export const ruleItems = [
  {
    id: 1,
    title: "مدارک لازم",
    options: [
      "کپی از گواهینامه رانندگی کشور محل سکونت و یا گواهینامه بین‌المللی فرد",
      "ارائه کارت ملی",
      "مدارک شغلی (هرگونه مدرکی که نشان دهنده شغل یا محل کار شما باشد)",
      "ارائه سفته (به ارزش خودرو برای ماشین‌های ایرانی و ارائه چک به ارزش خودرو برای ماشین‌های خارجی)",
      "پرداخت ضمانت نقدی که بسته به مدل خودرو متفاوت است.",
    ],
  },
  {
    id: 2,
    title: "مدارک لازم برای اجاره خودرو افراد خارجی",
    options: [
      "ارائه گواهینامه رانندگی با اعتبار حداقل 6 ماه",
      "کپی از پاسپورت برای خودروهای اقتصادی و اصل پاسپورت برای خودروهای لوکس",
      "ارائه بلیط برای تحویل خودرو در فرودگاه امام",
      "پرداخت ضمانت نقدی که بسته به مدل خودرو متفاوت است.",
    ],
  },
  {
    id: 3,
    title: "مدارک اجاره خودرو برای شرکت‌ها ",
    options: [
      "مدرک شناسایی مدیر شرکت",
      "ارائه اساسنامه شرکت",
      "دریافت چک شرکت",
      "پرداخت ضمانت نقدی که بسته به مدل خودرو متفاوت است.",
    ],
  },
];

export const insuransItems = [
  {
    id: 1,
    title: "بیمه پایه ",
    options: [
      "امداد جاده‌ای بصورت گسترده (ERA)",
      " ایمنی خودرو (SSP)",
      "پوشش کامل در برابر سرقت",
      "بیمه شخص ثالث (ALI) مبلغ بیمه پایه بصورت رایگان و روزانه است.",
    ],
  },
  {
    id: 2,
    title: "بیمه کامل ",
    options: [
      "امداد جاده‌ای گسترده (ERA)",
      "بیمه شخص ثالث (ALI)",
      "تعهد ایمنی خودرو (SSP)",
      "پوشش کامل ناشی از سرقت",
      "پرداخت خسارات جزئی (شیشه، لاستیک، بدنه)",
      "بیمه بدنه با حداقل مسئولیت (LDW)",
      "حداقل معافیت جهت افت قیمت مبلغ بیمه کامل بصورت روزانه حدود 35% کرایه خودرو است.",
    ],
  },
];
