export const blogItems = [
  {
    id: 1,
    title: "روش های مختلف برای اجاره خودرو ",
    text: " امروزه با تغییراتی که در سبک زندگی مردم و شرایط اقتصادی جوامع به وجود آمده است نیازهای افراد و نحوه دسترسی به آنها نیز دچار تحولاتی شده است.",
    readingTime: "3 دقیقه",
    image: "1.png",
    views: 1345,
    slug: "/blog/1",
  },
  {
    id: 2,
    title: "روش های مختلف برای اجاره خودرو ",
    text: " امروزه با تغییراتی که در سبک زندگی مردم و شرایط اقتصادی جوامع به وجود آمده است نیازهای افراد و نحوه دسترسی به آنها نیز دچار تحولاتی شده است.",
    readingTime: "2 دقیقه",
    image: "2.png",
    views: 324,
    slug: "/blog/2",
  },
  {
    id: 3,
    title: "روش های مختلف برای اجاره خودرو ",
    text: " امروزه با تغییراتی که در سبک زندگی مردم و شرایط اقتصادی جوامع به وجود آمده است نیازهای افراد و نحوه دسترسی به آنها نیز دچار تحولاتی شده است.",
    readingTime: "3 دقیقه",
    image: "3.png",
    views: 7453,
    slug: "/blog/3",
  },
];
