import prisma from "@/lib/prisma";

export async function seed() {
  await prisma.car.createMany({
    data: [
      // ------------------ بنز S500 ------------------
      {
        name: "بنز S500",
        model: 2018,
        brand: "mercedes",
        type: "Sedan",
        description:
          "مرسدس بنز S500 نماد لوکس‌بودن، کیفیت ساخت بی‌نظیر و سواری فوق‌العاده نرم است. این خودرو با موتور قدرتمند، تعلیق هوشمند و کابین بسیار آرام، تجربه‌ای تشریفاتی و بی‌رقیب ارائه می‌دهد. صندلی‌های راحت با تنظیمات کامل برقی، نورپردازی داخلی پیشرفته، و سیستم‌های ایمنی سطح بالا این خودرو را به انتخاب مناسب برای سفرهای شهری، بین‌شهری و مراسم خاص تبدیل کرده است. علاوه بر این، امکانات هوشمند رانندگی و شتاب‌گیری عالی باعث می‌شود سوارشدن بر S500 همواره لذت‌بخش و سطح بالا باشد.",
        mile_age: 10,
        capacity: 5,
        gear: "Automatic",
        steering: "Electric",
        fuel: "Gasoline",
        price_day: 4500000,
        price_month: 125000000,
        price_garranty: 60000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h31XTwpYVh6Vwro8skDKfTmc92FXBybIW3vSLz",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3gnzMfv8ksEbMG1K5ltxjq64CWwDyROhmaSZA",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h389QGIibVAKtZOYwimvy9GI4zdHPDBqa6eFoX",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3bif58X93GDCdw36xAuU5yoZelBFEkvWSYJPV",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3cttGEErjDbLHQZ72UMWXArIRqdTY89zkpN61",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3lXNS8XeTsXN6EFRyqDnPiabt4gHj5BMZQ8Io",
        ],
        features: [
          "گرمکن و تهویه صندلی",
          "سقف پانوراما",
          "سیستم PRE-SAFE",
          "نورپردازی داخلی 64 رنگ",
          "کروز کنترل هوشمند",
        ],
      },

      // ------------------ بنز LS کروک ------------------
      {
        name: "بنز LS کروک",
        model: 2014,
        brand: "mercedes",
        type: "Coupe",
        description:
          "بنز LS کروک یک خودروی کروک لوکس و جذاب است که برای رانندگی تفریحی، سفرهای ساحلی و تجربه‌ای کاملاً متفاوت طراحی شده است. با سقف جمع‌شونده برقی، طراحی چشم‌نواز و سواری نرم، حس آزادی و لذت رانندگی را چند برابر می‌کند. موتور قدرتمند و کابین باکیفیت همراه با امکانات رفاهی کاربردی باعث می‌شود این خودرو برای مراسم، عکس‌برداری و دورهمی‌های خاص بهترین گزینه باشد. LS کروک ترکیبی زیبا از اسپرت و لوکس‌بودن را در قالبی کروک ارائه می‌دهد.",
        mile_age: 18,
        capacity: 4,
        gear: "Automatic",
        steering: "Electric",
        fuel: "Gasoline",
        price_day: 3800000,
        price_month: 95000000,
        price_garranty: 50000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3pq5Tmto2oOfdrvMTAqYiyHEXW5Lz68B0FJxD",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3BwOBblizwSTtu79VxqyHJF6AbXpOcfUrvDRK",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3HTLgm3R4dEj9ZDTaktQC3GLPV7Oy1vu2zlwi",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3d5o1ARkbnUoO8DlrCt5M1weH6uAymNVKYkiB",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3OqoHdsa6RHb9T0FvYc1rmjxWuQM8siyUS3Vg",
        ],
        features: [
          "سقف جمع‌شونده برقی",
          "صندلی برقی با مموری",
          "سیستم صوتی Burmester",
          "کروز کنترل",
        ],
      },

      // ------------------ بنز E250 ------------------
      {
        name: "بنز E250",
        model: 2016,
        brand: "mercedes",
        type: "Sedan",
        description:
          "مرسدس بنز E250 یک سدان لوکس میان‌رده است که تعادل فوق‌العاده‌ای میان راحتی، کیفیت ساخت و امکانات رفاهی ارائه می‌دهد. این خودرو با کابین جادار، صندلی‌های راحت و سواری نرم، گزینه‌ای ایده‌آل برای سفرهای روزمره و شهری است. سیستم‌های امنیتی قدرتمند، امکانات هوشمند و طراحی کلاسیک بنز باعث شده E250 همچنان یکی از محبوب‌ترین گزینه‌ها برای استفاده حرفه‌ای و خانوادگی باشد. مصرف سوخت مناسب در کنار عملکرد مطمئن آن را به خودرویی اقتصادی و هم‌زمان لوکس تبدیل کرده است.",
        mile_age: 22,
        capacity: 5,
        gear: "Automatic",
        steering: "Hydraulic",
        fuel: "Gasoline",
        price_day: 2100000,
        price_month: 60000000,
        price_garranty: 25000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3XCXEk5N41Q5ckfuZTM86HF0zltLUPAdyYEVs",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3plgjdfo2oOfdrvMTAqYiyHEXW5Lz68B0FJxD",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3RChyYOM826h3kKvLEe9RQybZouMrjPCVcfNS",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3znKmvD2ODkEJcjTumpZGrA20MaF4Qwb9S1ho",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3rNCwEuJIY9P7J1apwyHgANF5Mih4OfjcS6tx",
        ],
        features: ["نورپردازی داخلی", "سیستم کنترل کشش", "سنسور جلو و عقب", "کروز کنترل"],
      },

      // ------------------ بنز CLS ------------------
      {
        name: "بنز CLS",
        model: 2017,
        brand: "mercedes",
        type: "Coupe",
        description:
          "مرسدس بنز CLS یک کوپه چهاردر لوکس با طراحی بسیار جذاب و اسپرت است که ترکیبی از زیبایی، قدرت و راحتی را ارائه می‌دهد. این خودرو با کابین مدرن، صندلی‌های مجهز، نورپردازی داخلی و امکانات ایمنی پیشرفته، تجربه‌ای سطح بالا برای راننده و سرنشینان فراهم می‌کند. موتور قدرتمند و هندلینگ عالی باعث می‌شود CLS در سفرهای شهری و بین‌شهری عملکردی فوق‌العاده داشته باشد. این خودرو برای افراد علاقه‌مند به طراحی متفاوت و رانندگی لوکس گزینه‌ای بی‌نظیر محسوب می‌شود.",
        mile_age: 15,
        capacity: 4,
        gear: "Automatic",
        steering: "Electric",
        fuel: "Gasoline",
        price_day: 3200000,
        price_month: 89000000,
        price_garranty: 45000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3Yee9H8h6R4zrIsqcSJyUF3VTuK82awgpfkdh",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3PWZ4vVXCKN0QaU4h3bXduwZjio1eH6A8JpGR",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3Bw9e98VzwSTtu79VxqyHJF6AbXpOcfUrvDRK",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3barwMu3GDCdw36xAuU5yoZelBFEkvWSYJPVj",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h38ZZWGypbVAKtZOYwimvy9GI4zdHPDBqa6eFo",
        ],
        features: ["سقف پانوراما", "سیستم Distronic", "گرمکن و سردکن صندلی", "سنسور پارک 360 درجه"],
      },

      // ------------------ بی ام و (سری 530 مثال) ------------------
      {
        name: "بی ام و 530i",
        model: 2018,
        brand: "bmw",
        type: "Sedan",
        description:
          "BMW 530i یک سدان لوکس اسپرت است که به خاطر هندلینگ فوق‌العاده، کیفیت ساخت بالا و تجربه رانندگی پویا شناخته می‌شود. این خودرو با موتور قدرتمند، سیستم تعلیق دقیق و فرمان‌پذیری عالی، حس رانندگی اسپرت واقعی را منتقل می‌کند. کابین باکیفیت با نورپردازی زیبا، صندلی‌های راحت و امکانات هوشمند، آن را برای استفاده روزانه و سفرهای طولانی ایده‌آل می‌سازد. 530i یکی از محبوب‌ترین مدل‌های بی‌ام‌و در میان علاقه‌مندان به خودروهای لوکس و اسپرت است.",
        mile_age: 20,
        capacity: 5,
        gear: "Automatic",
        steering: "Electric",
        fuel: "Gasoline",
        price_day: 3500000,
        price_month: 98000000,
        price_garranty: 45000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3MHNnsmgc0qFYmB1JoXhZzlT4xNeW6pjAsk3D",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3j0zF0OopEq4oBw0leSFTbsHtNYnI2pLVJGXd",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3DC2pTtBuIyq9Jn1FODXjV6fRNQZorhlKwWtg",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3MbbL1uagc0qFYmB1JoXhZzlT4xNeW6pjAsk3",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h39Xo6xiWjZFD5AiTmWU9VSHxpdRw1CL4Meohv",
        ],
        features: ["هدآپ دیسپلی", "پارک اتوماتیک", "نورپردازی داخلی", "سیستم صوتی Harman Kardon"],
      },

      // ------------------ لندکروز ------------------
      {
        name: "تويوتا لندکروز",
        model: 2013,
        brand: "toyota",
        type: "SUV",
        description:
          "لندکروز یکی از قدرتمندترین و محبوب‌ترین شاسی‌بلندهای جهان است که به‌خاطر دوام فوق‌العاده، توانایی آفرود و کیفیت ساخت بی‌نظیر شناخته می‌شود. این خودرو برای مسیرهای سخت، سفرهای طولانی و شرایط جاده‌ای چالش‌برانگیز ساخته شده است. کابین جادار و صندلی‌های بزرگ آن مناسب خانواده‌ها و گروه‌های سفری است. لندکروز ترکیبی از قدرت، راحتی و قابلیت اطمینان را ارائه می‌دهد و همچنان یکی از بهترین انتخاب‌ها برای سفرهای خارج جاده‌ای و شهری محسوب می‌شود.",
        mile_age: 50,
        capacity: 7,
        gear: "Automatic",
        steering: "Hydraulic",
        fuel: "Gasoline",
        price_day: 4800000,
        price_month: 140000000,
        price_garranty: 70000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3golx7Z8ksEbMG1K5ltxjq64CWwDyROhmaSZA",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3XE8cCpN41Q5ckfuZTM86HF0zltLUPAdyYEVs",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3rRb88d3JIY9P7J1apwyHgANF5Mih4OfjcS6t",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3JYVXBcHCkn3G1dLh0ptwHM5rbN2VeosW8qJF",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3AFm34QE1Uqh5tfNKX8rcTbVFL6OJoIQ0wHgy",
        ],
        features: [
          "قفل دیفرانسیل",
          "سیستم Crawl Control",
          "صندلی‌های بزرگ و راحت",
          "شاسی بسیار قوی",
        ],
      },

      // ------------------ هیوندای توسان ------------------
      {
        name: "هیوندای توسان",
        model: 2017,
        brand: "hyundai",
        type: "SUV",
        description:
          "هیوندای توسان یک کراس‌اوور محبوب و اقتصادی است که با طراحی مدرن، مصرف سوخت مناسب و امکانات رفاهی کاربردی شناخته می‌شود. این خودرو سواری نرم و راحتی ارائه می‌دهد و کابین آن برای خانواده‌ها و سفرهای روزانه کاملاً مناسب است. امکاناتی مانند سقف پانوراما، نمایشگر بزرگ و سیستم‌های ایمنی به‌روز، تجربه رانندگی را دلپذیر می‌کند. توسان انتخابی عالی برای رانندگان به دنبال خودرویی زیبا، کم‌مصرف و خانوادگی است.",
        mile_age: 30,
        capacity: 5,
        gear: "Automatic",
        steering: "Electric",
        fuel: "Gasoline",
        price_day: 1500000,
        price_month: 38000000,
        price_garranty: 15000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h38AwLwXbVAKtZOYwimvy9GI4zdHPDBqa6eFoX",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3RL0WvoM826h3kKvLEe9RQybZouMrjPCVcfNS",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3uOFKQ74Sxjp72BgUXFolMhDbdnQELZTOw3zt",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3htWBiYnTaN9nxpMIFvwzCsbL7i8jKeoEGcDV",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3HNNlYrR4dEj9ZDTaktQC3GLPV7Oy1vu2zlwi",
        ],
        features: ["سقف پانوراما", "کروز کنترل", "مانیتور بزرگ", "سنسور باران"],
      },

      // ------------------ آزرا گرنجور ------------------
      {
        name: "هیوندای آزرا گرنجور",
        model: 2015,
        brand: "hyundai",
        type: "Sedan",
        description:
          "آزرا گرنجور یکی از لوکس‌ترین سدان‌های هیوندای است که با فضای داخلی جادار، سواری نرم و امکانات رفاهی فراوان، تجربه‌ای آرام و لذت‌بخش ارائه می‌دهد. این خودرو با موتور قدرتمند، صندلی‌های مجهز، نورپردازی زیبا و عایق‌بندی عالی کابین یکی از بهترین گزینه‌ها برای سفرهای طولانی است. کیفیت ساخت بالا و امکانات ایمنی هوشمند آن باعث می‌شود آزرا گرنجور انتخابی مناسب برای خانواده‌ها و افراد علاقه‌مند به خودروهای راحت و لوکس باشد.",
        mile_age: 25,
        capacity: 5,
        gear: "Automatic",
        steering: "Electric",
        fuel: "Gasoline",
        price_day: 1800000,
        price_month: 50000000,
        price_garranty: 20000000,
        cover: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3JAq7QSHCkn3G1dLh0ptwHM5rbN2VeosW8qJF",
        images: [
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3kZrrxqjKWEUnm3YAixb2rO6lvuPGzywV548e",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3KE5wgtOisZXzcb4Y73LOoEmU9QnG5wkJAgNl",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3Ik95HMchUmpz9FZe7B1M6cdu3wrjqfCRl2y8",
          "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3YqtyUYh6R4zrIsqcSJyUF3VTuK82awgpfkdh",
        ],
        features: [
          "گرمکن و سردکن صندلی",
          "سقف پانوراما",
          "کروز کنترل هوشمند",
          "سیستم صوتی قدرتمند",
        ],
      },
    ],
  });
  await prisma.user.createMany({
    data: [
      {
        id: "RaCackSswOvkZhkyc1pGGfOjJUb99uED",
        email: "09127817131@example.com",
        name: "محمد رحیمی",
        phoneNumber: "09127817131",
        phoneNumberVerified: true,
      },
      {
        id: "wptQyUkNrTJkCW75edCxT5YIPGBLSoTl",
        email: "09358865344@example.com",
        name: "علی رحیمی",
        phoneNumber: "09358865344",
        phoneNumberVerified: true,
      },
    ],
  });
  await prisma.blog.createMany({
    data: [
      {
        id: "cmid5w613000f8t8o2ggjpj5m",
        title: "مرسدس بنز s-class اوج لوکس‌سواری مدرن",
        slug: "mercedes-s-class-2025",
        content:
          '"### **1. طراحی بیرونی؛ ترکیبی از شکوه و تکنولوژی**\\n\\nمرسدس بنز S-Class همیشه نمادی از ظرافت آلمانی بوده است و نسل جدید آن این استاندارد را یک سطح بالاتر برده. خطوط بدنه، نرم‌تر و روان‌تر از نسل‌های گذشته‌اند و در کنار جلوپنجره‌ی عظیم، حس اقتدار را منتقل می‌کنند. نورپردازی دیجیتالی جلو که از هزاران LED بسیار ریز تشکیل شده، نه تنها زیباست، بلکه قابلیت شخصی‌سازی فوق‌العاده‌ای نیز دارد. از نمای کناری، تناسبات بدنه به‌گونه‌ای طراحی شده‌اند که هم حس کشیدگی و هم لوکس‌بودن را القا کنند. رینگ‌های ۲۰ یا ۲۱ اینچی با طرح‌های کروم، جلوه‌ی اشرافی خودرو را تکمیل می‌کنند. از پشت نیز چراغ‌های باریک و مینیمال، ظاهر مدرن و لوکس خودرو را دوچندان کرده‌اند و همه چیز کاملاً در جهت نمایش قدرت، اصالت و مهندسی آلمان طراحی شده است.\\n\\n### **2. کابین؛ تجربه‌ای شبیه هواپیمای فرست‌کلاس**\\n\\nکابین S-Class چیزی فراتر از یک خودروست؛ یک تجربه‌ی کامل از آرامش، تکنولوژی و راحتی. نمایشگر بزرگ مرکزی با رزولوشن خیره‌کننده، سیستم صوتی Burmester سه‌بعدی، نورپردازی ۶۴ رنگ و صندلی‌هایی با ماساژور و تهویه، تنها بخشی از جذابیت‌های کابین هستند. چرم ناپا با دوخت دست، در کنار چوب طبیعی یا آلومینیوم برس‌خورده، فضایی را ایجاد می‌کنند که حتی در خودروهای چند میلیاردی نیز کمتر دیده می‌شود. سیستم کنترل حرکتی، هوش مصنوعی تشخیص حالت چهره، و توانایی یادگیری عادات راننده، باعث شده تجربه‌ی استفاده از این کابین شبیه هیچ خودرو دیگری نباشد. مرسدس حتی سیستم تصفیه هوای کابین را ارتقا داده تا بهترین کیفیت هوا در مسیرهای طولانی نیز حفظ شود.\\n\\n### **3. پیشرانه و تجربه رانندگی**\\n\\nS-Class تنها لوکس نیست؛ بلکه یک هیولای نرم در جاده است. نسخه S500 با موتور ۳ لیتری توربو و سیستم Mild Hybrid قدرتی تولید می‌کند که هم شتاب‌گیری نرم ارائه می‌دهد و هم در مصرف سوخت صرفه‌جویی می‌کند. سیستم تعلیق بادی جدید، ناهمواری‌های جاده را تقریباً حذف می‌کند و تجربه رانندگی را شبیه شناور بودن روی ابرها می‌سازد. فرمان‌پذیری چرخ‌های عقب، شعاع گردش خودرو را کاهش می‌دهد و آن را در خیابان‌های باریک تبدیل به یک سدان چالاک می‌کند. از نظر ایمنی نیز تکنولوژی‌های جدید مانند سیستم پیش‌فعالسازی تصادف، توانایی بلند کردن خودرو پیش از برخورد جانبی و ترمز اضطراری هوشمند، S-Class را به یکی از امن‌ترین سدان‌های دنیا تبدیل کرده‌اند.\\n"',
        cover_img: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3y5o6dCAJL4u8vxiRVGweIrnXH9PCTDUYdFjA",
        reading_time: "5",
        author_id: "wptQyUkNrTJkCW75edCxT5YIPGBLSoTl",
        created_at: "2025-11-24T13:07:31.283Z",
        updated_at: "2025-11-24T13:07:31.283Z",
      },
      {
        id: "cmid5z4e5000h8t8ogia1pq8l",
        title: "پورشه 911 توربو S هنر مهندسی اسپرت",
        slug: "poche-911-s-turbo",
        content:
          '"### **. طراحی کلاسیک اما مدرن**\\n\\nپورشه 911 توربو S با اینکه طراحی تاریخی خود را حفظ کرده، اما با هر نسل مدرن‌تر شده است. فرم بیضی چراغ‌ها، بدنه پهن و خطوط عضلانی روی گلگیرها هویت، اصالت و قدرت خودرو را فریاد می‌زنند. اسپویلر عقب فعال، در سرعت‌های بالا عملکرد آیرودینامیکی را بهتر می‌کند و ظاهری بسیار جسورانه‌تر ایجاد می‌کند. ورودی‌های هوای بزرگ‌تر برای تغذیه توربوها طراحی شده‌اند و سپر عقب با طراحی اسپرت و خروجی‌های اگزوز دوگانه، ظاهر خودرو را به یک جنگجوی واقعی جاده تبدیل کرده است. در مجموع طراحی 911 توربو S بدون اغراق یکی از بهترین ترکیب‌های اسپرت کلاسیک و تکنولوژی مدرن محسوب می‌شود.\\n\\n### **2. قدرت بی‌پایان؛ موتور ۶ سیلندر افسانه‌ای**\\n\\nقلب تپنده 911 توربو S یک موتور ۶ سیلندر تخت با قدرت بیش از ۶۴۰ اسب بخار است که شتاب‌گیری صفر تا صد ۲.۶ ثانیه را ممکن می‌کند. این اعداد برای یک خودروی اسپرت خیابانی تقریباً غیرواقعی به نظر می‌رسند. گیربکس PDK با دقت مثال‌زدنی دنده‌ها را در کسری از ثانیه تعویض می‌کند و سیستم چهارچرخ محرک هوشمند، چسبندگی خودرو را در هر شرایطی تضمین می‌کند. حتی در باران یا جاده‌های لغزنده نیز 911 توربو S مثل قطار روی ریل می‌چسبد و با اطمینان کامل شتاب می‌گیرد. اضافه‌کردن سیستم تعلیق فعال، پایداری خودرو را در پیچ‌ها به سطحی فراتر از باور می‌رساند.\\n\\n### **3. کابین اسپرت؛ ساده اما لوکس**\\n\\nکابین پورشه بر خلاف برخی سوپر اسپرت‌ها بسیار کاربردی و هم‌زمان لوکس است. صندلی‌های اسپرت با پوشش چرم و آلکانترا، صفحه کیلومتر پنج‌دایره‌ای معروف 911، و نمایشگر مرکزی بزرگ تجربه‌ای ترکیبی از کلاسیک و مدرن ارائه می‌دهند. کیفیت ساخت در هر بخش کابین مثال‌زدنی است؛ تمام دکمه‌ها و کلیدها با دقت و وزن مناسب طراحی شده‌اند. سیستم صوتی Bose یا Burmester و ارگونومی عالی باعث می‌شود حتی در سفرهای طولانی احساس خستگی نداشته باشید. همه چیز در کابین 911 با هدف تجربه رانندگی بی‌نقص ساخته شده است.\\n"',
        cover_img: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3o4saIB0VPKOpytFlUuCDh2GAvSJB3NnEbXzx",
        reading_time: "4",
        author_id: "wptQyUkNrTJkCW75edCxT5YIPGBLSoTl",
        created_at: "2025-11-24T13:09:49.181Z",
        updated_at: "2025-11-24T13:09:49.181Z",
      },
      {
        id: "cmid62jbl000j8t8oasg8nfan",
        title: "بی‌ام‌و X7  شاسی‌بلند اشرافی با روح اسپرت",
        slug: "bmw-x7",
        content:
          '"### **. ظاهر جسور و عظیم**\\n\\nX7 بزرگ‌ترین شاسی‌بلند بی‌ام‌و است و طراحی آن قصد دارد عظمت را فریاد بزند. جلوپنجره بزرگ، چراغ‌های باریک، و سپر تهاجمی حس قدرت و پرستیژ را القا می‌کنند. ارتفاع بلند و رینگ‌های ۲۲ اینچی، حضور این خودرو را در خیابان کاملاً متمایز می‌کند. خط شانه‌ای کشیده و سقف نسبتاً صاف نیز نشان می‌دهد که X7 برای حمل خانواده‌ها در بهترین سطح ممکن طراحی شده است. ترکیب شیشه‌های بزرگ و ستون‌های ضخیم حس امنیت و شکوه را افزایش می‌دهد. ظاهر عقب خودرو نیز با چراغ‌های کریستالی و دیفیوزر اسپرت تکمیل می‌شود.\\n\\n### **2. کابین باشکوه‌تر از خانه‌های لوکس**\\n\\nکابین X7 یکی از مجلل‌ترین کابین‌هایی است که در دنیای شاسی‌بلند‌ها دیده می‌شود. متریال کابین از چرم مرینو و چوب طبیعی تا کریستال در اهرم دنده، همه نشان‌دهنده توجه بی‌ام‌و به ریز‌ترین جزئیات است. نورپردازی داخلی، سیستم تهویه سه‌گانه، و نمایشگرهای بزرگ جلو و عقب، X7 را شبیه یک اتاق VIP متحرک کرده‌اند. صندلی‌های ردیف دوم می‌توانند به‌صورت کاپیتانی سفارش داده شوند و با ماساژور، گرم‌کن و سردکن، تجربه‌ای مثل بیزنس‌کلاس هواپیما ارائه می‌دهند. حتی سرنشینان ردیف سوم نیز فضای کافی و راحتی دارند که در بسیاری از شاسی‌بلندها دیده نمی‌شود.\\n\\n### **3. قدرت و سواری**\\n\\nX7 با موتورهای ۶ و ۸ سیلندر عرضه می‌شود و شتابی فراتر از انتظار برای خودرویی با این اندازه دارد. سیستم xDrive چهارچرخ محرک، پایداری خودرو را حتی در سرعت‌های بالا تضمین می‌کند. سیستم تعلیق بادی هوشمند، ناهمواری‌ها را بدون انتقال به کابین جذب می‌کند و شما را در سکوت و آرامش کامل نگه می‌دارد. بی‌ام‌و با استفاده از تکنولوژی‌های کمک‌رسان پیشرفته مثل نگه‌داشتن در لاین، کروز کنترل هوشمند، و ترمز اضطراری خودکار، تجربه رانندگی را امن و راحت کرده است. X7 در واقع ترکیبی است از لوکس‌بودن، اسپرت‌بودن و راحتی خانوادگی.\\n"',
        cover_img: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3JMojFWzHCkn3G1dLh0ptwHM5rbN2VeosW8qJ",
        reading_time: "6",
        author_id: "wptQyUkNrTJkCW75edCxT5YIPGBLSoTl",
        created_at: "2025-11-24T13:12:28.497Z",
        updated_at: "2025-11-24T13:12:28.497Z",
      },
      {
        id: "cmid77doa000p8t8ousz2c75a",
        title: "لامبورگینی اوروس؛ هیولای لوکس دنیای شاسی‌بلند‌ها",
        slug: "lamburgini-urus",
        content:
          '"## **1. طراحی تهاجمی با اصالت لامبورگینی**\\n\\nUrus شاید یک SUV باشد، اما DNA کامل لامبورگینی را در ظاهر خود حفظ کرده است. خطوط شکسته، هواکش‌های بزرگ و چراغ‌هایی با طراحی Y-Shape، این خودرو را به یکی از شگفت‌انگیزترین SUVهای دنیا تبدیل کرده. طراحی آن به‌گونه‌ای است که حتی وقتی پارک شده باشد، انگار در حال حمله به جلو است. استفاده از فیبرکربن، آیرودینامیک پیشرفته و ارتفاع قابل تنظیم از ویژگی‌های مشخص این مدل هستند. رنگ‌های خاص لامبورگینی نیز جذابیت ظاهری اوروس را دوچندان می‌کنند. در کل، اوروس به‌خوبی توانسته تعادلی میان خشونت بصری و زیبایی مدرن ایجاد کند و همین موضوع آن را در میان طرفداران خودروهای لوکس بسیار محبوب کرده است.\\n\\n## **۲. کابین اسپرت اما لوکس؛ ترکیب فضای SUV و روح سوپراسپرت**\\n\\nفضای داخلی Urus از چرم باکیفیت، آلکانترا و فیبرکربن ساخته شده و حس رانندگی یک هواپیمای جنگنده را القا می‌کند. سه نمایشگر لمسی، داشبورد لایه‌ای و دکمه Start شبیه جنگنده، حس اسپرت بودن را به اوج می‌رسانند. صندلی‌ها به‌طور کامل ارگونومیک طراحی شده و در عین اسپرت بودن، راحتی فوق‌العاده‌ای دارند. فضای کافی برای سرنشینان عقب نیز وجود دارد و این موضوع آن را از یک سوپراسپرت معمولی متمایز می‌کند. سیستم صوتی Bang & Olufsen، نورپردازی داخلی و صندوق بار بزرگ نشان می‌دهند که Urus ضمن حفظ خوش‌تیپی خود، یک SUV واقعی نیز هست. این ترکیب جذاب باعث شده اوروس میان خانواده‌ها و افراد ماجراجو بسیار پرطرفدار باشد.\\n\\n## **۳. قدرت مهارناشدنی؛ بهترین عملکرد در میان SUVهای لوکس**\\n\\nUrus از یک موتور ۴.۰ لیتری V8 توئین توربو بهره می‌برد که حدود ۶۵۰ اسب‌بخار قدرت تولید می‌کند. این شتاب باورنکردنی برای یک SUV باعث شده اوروس در کمتر از ۳.۶ ثانیه به ۱۰۰ کیلومتر برسد. سیستم چهارچرخ متحرک، ترمزهای کربن سرامیکی و حالت‌های مختلف Terrain این خودرو را برای هر نوع مسیر آماده می‌کند. در پیچ‌ها باورنکردنی عمل می‌کند و پایدارترین SUV پرقدرت جهان نام گرفته است. در کنار عملکرد خارق‌العاده، سیستم اکزوز با صدای غرش‌ مانند نیز تجربه رانندگی را به سطحی متفاوت می‌رساند. ترکیب لوکس بودن و این حجم از قدرت، Urus را به یک پدیده منحصربه‌فرد تبدیل کرده که در دنیای خودروهای لوکس تقریباً رقیبی ندارد.\\n"',
        cover_img: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3O3fnjsa6RHb9T0FvYc1rmjxWuQM8siyUS3Vg",
        reading_time: "6",
        author_id: "wptQyUkNrTJkCW75edCxT5YIPGBLSoTl",
        created_at: "2025-11-24T13:44:14.023Z",
        updated_at: "2025-11-24T13:44:14.023Z",
      },
      {
        id: "cmid7u60c000r8t8o1hd85jxd",
        title: "لکسوس LFA  شاهکار ژاپنی که افسانه شد",
        slug: "lexus-lfa",
        content:
          '"## **1. مهندسی صوتی بی‌رقیب؛ موتوری که موسیقی تولید می‌کند**\\n\\nیکی از مهم‌ترین دلایل خاص بودن LFA موتوری است که همکاری مشترک **Yamaha Performance** و **Toyota Racing** است.\\\\\\nاین موتور 4.8 لیتری V10 می‌تواند در کمتر از یک دهم ثانیه از دور آرام به ردلاین برسد؛ یعنی سریع‌تر از آنکه عقربه‌های آنالوگ بتوانند نمایش دهند! همین موضوع باعث شد لکسوس تصمیم بگیرد نمایشگر آنالوگ را با دیجیتال جایگزین کند.\\n\\nصدای این موتور با همکاری مهندسان یاماها و استفاده از طراحی مخصوص اتاقک صوتی تنظیم شده تا صدایی شبیه یک موتور فرمول یک تولید کند. صدایی که ترکیبی از جیغ‌های زیر ویولن و غرش یک هیولای وحشی است. بسیاری معتقدند LFA بهترین صدای احتراق داخلی را در تمام دوران دارد.\\n\\nیوتیوبرها، مجلات خودرویی و حتی رانندگان حرفه‌ای این خودرو را به‌خاطر قدرت موسیقایی صدای خروجی‌اش ستایش می‌کنند. این ماشین نه تنها سریع است، بلکه هنگام شتاب‌گیری، یک سمفونی واقعی اجرا می‌کند.\\n\\n## **2. استفاده گسترده از فیبرکربن؛ تولدی دوباره برای لکسوس**\\n\\nتولید LFA نقطه عطفی در داستان لکسوس بود، زیرا این شرکت برای اولین بار سیستم اختصاصی تولید **فیبرکربن بافته‌شده (CFRP)** را معرفی کرد.\\\\\\nحدود **۶۵ درصد بدنه خودرو** از فیبرکربن ساخته شد، تصمیمی که باعث شد وزن خودرو به‌شدت کاهش یافته و در عین حال استحکام فوق‌العاده‌ای ایجاد شود.\\n\\nساخت فیبرکربن LFA به‌قدری پیچیده و دقیق بود که لکسوس یک دستگاه بافندگی فیبرکربن اختصاصی ساخت؛ دستگاهی که در هیچ خودروی تجاری دیگری استفاده نشده بود.\\n\\nاین سطح توجه و دقت باعث شد LFA فقط یک خودرو نباشد، بلکه یک ویترین تکنولوژی برای آینده لکسوس شود. بسیاری از فناوری‌های بدنه‌ی LC500 و مدل‌های F امروزی از همین پروژه ریشه گرفته‌اند.\\n\\n## **۳. تولید محدود و ارزش کلکسیونی؛ چرا قیمت LFA مدام بالا می‌رود؟**\\n\\nوقتی LFA معرفی شد قیمت 375,000 دلار داشت، اما حالا در بازارهای حراجی به قیمت **بیش از یک میلیون دلار** معامله می‌شود.\\\\\\nعلت این افزایش قیمت سریع:\\n\\n* تولید محدود فقط 500 دستگاه\\n\\n* صدای موتور بی‌نظیر که دیگر در دوران خودروهای الکتریکی تکرار نمی‌شود\\n\\n* کیفیت ساخت بسیار بالا و دست‌ساز\\n\\n* محبوبیت عجیب بین کلکسیونرها\\n\\n* نقش تاریخی در تحول برند لکسوس\\n\\nاین خودرو مانند یک تابلو نقاشی یا یک ساز هنری ارزشمند است؛ نه تنها سریع و زیباست، بلکه داستان و هویتی دارد که باعث شده تبدیل به یکی از مهم‌ترین خودروهای ژاپنی تاریخ شود.\\n\\nامروزه بسیاری از کلکسیونرها LFA را «آخرین سوپراسپرت واقعاً خالص ژاپنی» می‌دانند.\\n"',
        cover_img: "https://j4j4h3h02f.ufs.sh/f/RWRrdYM826h3afscs5e1Ic4WGVkHBl2uSMZU3bRJLqzXipYt",
        reading_time: "8",
        author_id: "wptQyUkNrTJkCW75edCxT5YIPGBLSoTl",
        created_at: "2025-11-24T14:01:57.228Z",
        updated_at: "2025-11-24T14:01:57.228Z",
      },
    ],
  });
}

seed()
  .catch(e => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
